## Q1

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql="SELECT price,bookname FROM book;"

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

       0                  1
0   7000             축구의 역사
1  13000            축구아는 여자
2  22000             축구의 이해
3  35000             골프 바이블
4   8000              피겨 교본
5   6000           역도 단계별기술
6  20000             야구의 추억
7  13000            야구를 부탁해
8   7500            올림픽 이야기
9  13000  Olympic Champions

## Q2

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql="SELECT * FROM book;"

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0   1             축구의 역사     굿스포츠   7000
1   2            축구아는 여자      나무수  13000
2   3             축구의 이해    대한미디어  22000
3   4             골프 바이블    대한미디어  35000
4   5              피겨 교본     굿스포츠   8000
5   6           역도 단계별기술     굿스포츠   6000
6   7             야구의 추억    이상미디어  20000
7   8            야구를 부탁해    이상미디어  13000
8   9            올림픽 이야기      삼성당   7500
9  10  Olympic Champions  Pearson  13000

## Q3

In [13]:
import pandas as pd
import pymysql

In [14]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [15]:
cur_1=conn1.cursor()

In [16]:
sql="SELECT DISTINCT publisher FROM book;"

In [17]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [18]:
pd_1=pd.DataFrame(rows_1)
pd_1

         0
0     굿스포츠
1      나무수
2    대한미디어
3    이상미디어
4      삼성당
5  Pearson

## Q4

In [19]:
import pandas as pd
import pymysql

In [20]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [21]:
cur_1=conn1.cursor()

In [22]:
sql="SELECT * FROM book WHERE price<20000;"

In [23]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [24]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0   1             축구의 역사     굿스포츠   7000
1   2            축구아는 여자      나무수  13000
2   5              피겨 교본     굿스포츠   8000
3   6           역도 단계별기술     굿스포츠   6000
4   8            야구를 부탁해    이상미디어  13000
5   9            올림픽 이야기      삼성당   7500
6  10  Olympic Champions  Pearson  13000

## Q5

In [25]:
import pandas as pd
import pymysql

In [26]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [27]:
cur_1=conn1.cursor()

In [28]:
sql="SELECT * FROM book WHERE price BETWEEN 10000 AND 20000;"

In [29]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [30]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0   2            축구아는 여자      나무수  13000
1   7             야구의 추억    이상미디어  20000
2   8            야구를 부탁해    이상미디어  13000
3  10  Olympic Champions  Pearson  13000

## Q6

In [31]:
import pandas as pd
import pymysql

In [32]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [33]:
cur_1=conn1.cursor()

In [34]:
sql="SELECT * FROM book WHERE publisher IN('굿스포츠','대한미디어');"

In [35]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [36]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0         1      2      3
0  1    축구의 역사   굿스포츠   7000
1  3    축구의 이해  대한미디어  22000
2  4    골프 바이블  대한미디어  35000
3  5     피겨 교본   굿스포츠   8000
4  6  역도 단계별기술   굿스포츠   6000

## Q7

In [37]:
import pandas as pd
import pymysql

In [38]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [39]:
cur_1=conn1.cursor()

In [40]:
sql="SELECT * FROM book WHERE publisher NOT IN('굿스포츠','대한미디어');"

In [41]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [42]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0   2            축구아는 여자      나무수  13000
1   7             야구의 추억    이상미디어  20000
2   8            야구를 부탁해    이상미디어  13000
3   9            올림픽 이야기      삼성당   7500
4  10  Olympic Champions  Pearson  13000

## Q8

In [43]:
import pandas as pd
import pymysql

In [44]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [45]:
cur_1=conn1.cursor()

In [46]:
sql="SELECT bookname,publisher FROM book WHERE bookname LIKE'축구의 역사';"

In [47]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [48]:
pd_1=pd.DataFrame(rows_1)
pd_1

        0     1
0  축구의 역사  굿스포츠

## Q9

In [49]:
import pandas as pd
import pymysql

In [50]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [51]:
cur_1=conn1.cursor()

In [52]:
sql="SELECT bookname,publisher FROM book WHERE bookname LIKE'%축구%';"

In [53]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [54]:
pd_1=pd.DataFrame(rows_1)
pd_1

         0      1
0   축구의 역사   굿스포츠
1  축구아는 여자    나무수
2   축구의 이해  대한미디어

## Q10

In [55]:
import pandas as pd
import pymysql

In [56]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [57]:
cur_1=conn1.cursor()

In [58]:
sql="SELECT * FROM book WHERE bookname LIKE'_구%';"

In [59]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [60]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0        1      2      3
0  1   축구의 역사   굿스포츠   7000
1  2  축구아는 여자    나무수  13000
2  3   축구의 이해  대한미디어  22000
3  7   야구의 추억  이상미디어  20000
4  8  야구를 부탁해  이상미디어  13000

## Q11

In [61]:
import pandas as pd
import pymysql

In [62]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [63]:
cur_1=conn1.cursor()

In [64]:
sql="SELECT * FROM book WHERE bookname LIKE'%축구%'AND price>=20000;"

In [65]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [66]:
pd_1=pd.DataFrame(rows_1)
pd_1

   0       1      2      3
0  3  축구의 이해  대한미디어  22000

## Q12

In [67]:
import pandas as pd
import pymysql

In [68]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [69]:
cur_1=conn1.cursor()

In [70]:
sql="SELECT * FROM book ORDER BY bookname;"

In [71]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [72]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0  10  Olympic Champions  Pearson  13000
1   4             골프 바이블    대한미디어  35000
2   8            야구를 부탁해    이상미디어  13000
3   7             야구의 추억    이상미디어  20000
4   6           역도 단계별기술     굿스포츠   6000
5   9            올림픽 이야기      삼성당   7500
6   2            축구아는 여자      나무수  13000
7   1             축구의 역사     굿스포츠   7000
8   3             축구의 이해    대한미디어  22000
9   5              피겨 교본     굿스포츠   8000

## Q13

In [73]:
import pandas as pd
import pymysql

In [74]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='madang',charset='utf8')

In [75]:
cur_1=conn1.cursor()

In [76]:
sql="SELECT * FROM book ORDER BY price DESC,publisher ASC;"

In [77]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [78]:
pd_1=pd.DataFrame(rows_1)
pd_1

    0                  1        2      3
0   4             골프 바이블    대한미디어  35000
1   3             축구의 이해    대한미디어  22000
2   7             야구의 추억    이상미디어  20000
3  10  Olympic Champions  Pearson  13000
4   2            축구아는 여자      나무수  13000
5   8            야구를 부탁해    이상미디어  13000
6   5              피겨 교본     굿스포츠   8000
7   9            올림픽 이야기      삼성당   7500
8   1             축구의 역사     굿스포츠   7000
9   6           역도 단계별기술     굿스포츠   6000